In [1]:
import datetime
import requests

import pandas as pd
import numpy as np

## Golf Leaders of 2021

In [2]:
# Site URL
url = 'https://www.espn.com/golf/leaders'

# Retrieve page with the request module
response = requests.get(url)

In [3]:
# Read in all html tables and put into dataframes
tables = pd.read_html(url)

In [4]:
# Empty list
golf_dfs = []

# Create list of dataframes
for df in tables:
    golf_dfs.append(df)

In [5]:
# Select dataframes that have actual statistics
money_leaders = golf_dfs[1]
total_cuts_made = golf_dfs[2]
putting_avg = golf_dfs[3]
fedex_cup_points = golf_dfs[4]
avg_drive = golf_dfs[5]
drive_accuracy = golf_dfs[6]

# Create list of dataframes
list_of_dfs = [money_leaders, total_cuts_made, 
               putting_avg, fedex_cup_points, 
               avg_drive, drive_accuracy]

# Empty List
new_list = []

# Re-format the dataframe. Drop first column. Store and rename column headers. 
# Strip rank from beginning of player string. Place in new list
for df in list_of_dfs:
    df = df.drop(columns=[0])
    player_header = df.loc[0][1]
    stat_header = df.loc[0][2]
    df = df.rename(columns={1: player_header, 2: stat_header}).drop([0,6])
    df[player_header] = df[player_header].str[3:]
    new_list.append(df)

#### Money Leaders

In [6]:
new_list[0]

              PLAYER         AMOUNT
1           Jon Rahm  $6,111,433.00
2  Bryson DeChambeau  $6,018,847.00
3      Justin Thomas  $5,907,945.00
4    Patrick Cantlay  $5,620,030.00
5     Harris English  $5,529,727.00

#### Total Cuts Made

In [7]:
new_list[1]

            PLAYER CUTS
1         Tom Hoge   29
2       Sungjae Im   28
3  Patrick Rodgers   27
4      Adam Schenk   27
5     Troy Merritt   26

#### Putting Average

In [8]:
new_list[2]

           PLAYER    AVG
1   Cameron Smith  1.705
2  Patton Kizzire  1.708
3  Anirban Lahiri  1.709
4    Patrick Reed  1.709
5   Justin Thomas  1.715

#### FedEx Cup Points Leaders

In [9]:
new_list[3]

              PLAYER POINTS
1    Patrick Cantlay   2014
2     Harris English   1889
3           Jon Rahm   1823
4  Bryson DeChambeau   1802
5      Jordan Spieth   1742

#### Average Drive

In [10]:
new_list[4]

              PLAYER   YARDS
1  Bryson DeChambeau  321.92
2       Rory McIlroy  318.72
3      Cameron Champ  318.04
4      Wyndham Clark  315.54
5        Will Gordon  314.60

#### Driving Accuracy

In [11]:
new_list[5]

         PLAYER    PCT
1  Brendon Todd  75.19
2   Ryan Armour  72.72
3  Brian Stuard  72.62
4   Chez Reavie  72.02
5    Ryan Moore  71.40